Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitResponse
Represents the response received when initializing a model version, including model version and optional upload operation.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitResponse.Version
Gets or sets the model version details.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersionInitResponse.Upload
Gets or sets the information through which files can be uploaded.